app/views/items/show.html.erb

<h1><%= Item.find(@id).title%></h1>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

<br>
<img src="<%= Item.find(@id).image_url %>"> <br>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]